<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FillingSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'slug' => 'shokoladnaia',
                'name' => 'Шоколадная',
                'structure' => 'Мука, сахар,яйцо,сливочное масло, цельное сгущенное молоко, какао-порошок, подсолнечное масло, коньяк, ванилин.',
                'description' => 'Сочные шоколадные бисквиты с такими знакомыми нотами бельгийского шоколада и нежнейший шоколадный мусс, сделанный из настоящего какао. Сочная, яркая, бесконечно шоколадная и невероятно вкусная начинка, которую однозначно стоит попробовать.',
                'created_at' => today(),
                'updated_at' => today(),
            ],
            [
                'slug' => 'krasnyi_barhat',
                'name' => 'Красный бархат',
                'structure' => 'Мука, сахар, яйцо, какао, сметана, сахарная пудра, крахмал,кефир, подсолнечное масло, сода, разрыхлитель, соль, ванилин, пищевой краситель.',
                'description' => 'Контраст ярких красных коржей и белоснежного крема заставляет многих удивиться после разреза торта с такой начинкой. Но самое приятное впереди: по вкусу вас ожидает сочетание пористых влажных бисквитов и легкого сметанного крема, который буквально тает во рту.',
                'created_at' => today(),
                'updated_at' => today(),
            ],
            [
                'slug' => 'malinovy_i_krem_chiz',
                'name' => 'Малиновый крем-чиз',
                'structure' => 'Мука, сахар, яйцо,какао-порошок (высшей категории), сливки животные, сыр сливочный творожный, сахарная пудра, ванилин.',
                'description' => 'Начинка для любителей сочетания свежих ягод и бельгийского шоколада. Состоит из влажных шоколадных бисквитов, невесомого сырного крема и малинового конфи. Купаж свежих ягод добавляет нежное послевкусие. Идеально для праздников.',
                'created_at' => today(),
                'updated_at' => today(),
            ],
        ];

        DB::table('fillings')->insert($data);
    }
}
